def area(a, b):
    '''
    Принимает стороны прямоугольника a и b, возвращает его площадь.

    	Параметры:
        	a (float|int): первая сторона
        	b (float|int): вторая сторона

    	Возвращаемое значение:
        	area (float|int): площадь прямоугольника
    '''
    return a * b


def perimeter(a, b):
    '''
    Принимает стороны прямоугольника a и b, возвращает его периметр.

    	Параметры:
        	a (float|int): первая сторона
        	b (float|int): вторая сторона

    	Возвращаемое значение:
        	perimeter (float|int): периметр прямоугольника
    '''
    return 2 * (a + b)
