def area(a, h):
    '''
    Принимает сторону треугольника a и высоту h, опущенную на неё, возвращает площадь треугольника.

    	Параметры:
        	a (float|int): сторона треугольника
        	h (float|int): высота, опущенная на сторону a

    	Возвращаемое значение:
        	area (float): площадь треугольника
    '''
    return a * h / 2


def perimeter(a, b, c):
    '''
    Принимает стороны треугольника a, b, c, возвращает его периметр.

    	Параметры:
        	a (float|int): первая сторона
        	b (float|int): вторая сторона
        	c (float|int): третья сторона

    	Возвращаемое значение:
        	perimeter (float|int): периметр треугольника

    '''
    return a + b + c
